; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v8 - type_1 ?v7 - type_2)
 	      (pred_1 ?v4 - object ?v7 - type_2)
	      (pred_3 ?v8 - type_1 ?v3 - type_3)
	      (pred_2 ?v8 - type_1 ?v4 - object ?v3 - type_3))

   (:action op_2
       :parameters  (?v8 - type_1 ?v1 ?v5 - type_2)
       :precondition (and  (pred_4 ?v8 ?v1))
       :effect (and  (pred_4 ?v8 ?v5)
		     (not (pred_4 ?v8 ?v1))))

   (:action op_1
       :parameters (?v8 - type_1 ?v6 - object ?v2 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v2) (pred_4 ?v8 ?v2) (pred_3 ?v8 ?v3))
       :effect (and (pred_2 ?v8 ?v6 ?v3)
		    (not (pred_1 ?v6 ?v2)) 
		    (not (pred_3 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_1 ?v6 - object ?v2 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v6 ?v3) (pred_4 ?v8 ?v2))
       :effect (and (pred_1 ?v6 ?v2)
		    (pred_3 ?v8 ?v3)
		    (not (pred_2 ?v8 ?v6 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_01 obj_07 - type_3
obj_05 obj_08 obj_09 - type_2
obj_02 obj_04 obj_03 - object)
(:init
(pred_4 obj_06 obj_09)
(pred_3 obj_06 obj_01)
(pred_3 obj_06 obj_07)
(pred_1 obj_02 obj_08)
(pred_1 obj_04 obj_09)
(pred_1 obj_03 obj_05)
)
(:goal
(and
(pred_1 obj_02 obj_09)
(pred_1 obj_04 obj_05)
(pred_1 obj_03 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_07))))
)
)

; plan
1. (op_1 obj_06 obj_04 obj_09 obj_01)
   deleted: (pred_1 obj_04 obj_09) (pred_3 obj_06 obj_01)
   added: (pred_2 obj_06 obj_04 obj_01)
   goals met: 0 of 3
2. (op_2 obj_06 obj_09 obj_05)
   deleted: (pred_4 obj_06 obj_09)
   added: (pred_4 obj_06 obj_05)
   goals met: 0 of 3
3. (op_3 obj_06 obj_04 obj_05 obj_01)
   deleted: (pred_2 obj_06 obj_04 obj_01)
   added: (pred_1 obj_04 obj_05) (pred_3 obj_06 obj_01)
   goals met: 1 of 3
4. (op_1 obj_06 obj_03 obj_05 obj_01)
   deleted: (pred_1 obj_03 obj_05) (pred_3 obj_06 obj_01)
   added: (pred_2 obj_06 obj_03 obj_01)
   goals met: 1 of 3
5. (op_2 obj_06 obj_05 obj_08)
   deleted: (pred_4 obj_06 obj_05)
   added: (pred_4 obj_06 obj_08)
   goals met: 1 of 3
6. (op_3 obj_06 obj_03 obj_08 obj_01)
   deleted: (pred_2 obj_06 obj_03 obj_01)
   added: (pred_1 obj_03 obj_08) (pred_3 obj_06 obj_01)
   goals met: 2 of 3
7. (op_1 obj_06 obj_02 obj_08 obj_01)
   deleted: (pred_1 obj_02 obj_08) (pred_3 obj_06 obj_01)
   added: (pred_2 obj_06 obj_02 obj_01)
   goals met: 2 of 3
8. (op_2 obj_06 obj_08 obj_09)
   deleted: (pred_4 obj_06 obj_08)
   added: (pred_4 obj_06 obj_09)
   goals met: 2 of 3
9. (op_3 obj_06 obj_02 obj_09 obj_01)
   deleted: (pred_2 obj_06 obj_02 obj_01)
   added: (pred_1 obj_02 obj_09) (pred_3 obj_06 obj_01)
   goals met: 3 of 3
